<?php

use yii\db\Migration;
use app\models\Region;

/**
 * Class m240329_082938_add_rf_regions_and_capitals
 */
class m240329_082938_add_rf_regions_and_capitals extends Migration
{
    public $regions = [
        ['Адыгея', 'Майкоп', 'г'],
        ['Башкортостан', 'Уфа', 'г'],
        ['Бурятия', 'Улан-Удэ', 'г'],
        ['Алтай', 'Горно-Алтайск', 'г'],
        ['Дагестан', 'Махачкала', 'г'],
        ['Ингушетия', 'Назрань', 'г'],
        ['Кабардино-Балкарская республика', 'Нальчик', 'г'],
        ['Калмыкия', 'Элиста', 'г'],
        ['Карачаево-Черкессия', 'Черкесск', 'г'],
        ['Карелия', 'Петрозаводск', 'г'],
        ['Коми', 'Сыктывкар', 'г'],
        ['Марий Эл', 'Йошкар-Ола', 'г'],
        ['Мордовия', 'Саранск', 'г'],
        ['Саха (Якутия)', 'Якутск', 'г'],
        ['Северная Осетия-Алания', 'Владикавказ', 'г'],
        ['Татарстан', 'Казань', 'г'],
        ['Тыва', 'Кызыл', 'г'],
        ['Удмуртская республика', 'Ижевск', 'г'],
        ['Хакасия', 'Абакан', 'г'],
        ['Чеченская республика', 'Грозный', 'г'],
        ['Чувашская республика', 'Чебоксары', 'г'],
        ['Алтайский край', 'Барнаул', 'г'],
        ['Краснодарский край', 'Краснодар', 'г'],
        ['Красноярский край', 'Красноярск', 'г'],
        ['Приморский край', 'Владивосток', 'г'],
        ['Ставропольский край', 'Ставрополь', 'г'],
        ['Хабаровский край', 'Хабаровск', 'г'],
        ['Архангельская область', 'Архангельск', 'г'],
        ['Астраханская область', 'Астрахань', 'г'],
        ['Белгородская область', 'Белгород', 'г'],
        ['Брянская область', 'Брянск', 'г'],
        ['Владимирская область', 'Владимир', 'г'],
        ['Волгоградская область', 'Волгоград', 'г'],
        ['Вологодская область', 'Вологда', 'г'],
        ['Ивановская область', 'Иваново', 'г'],
        ['Иркутская область', 'Иркутск', 'г'],
        ['Калининградская область', 'Калининград', 'г'],
        ['Калужская область', 'Калуга', 'г'],
        ['Камчатский край', 'Петропавловск-Камчатский', 'г'],
        ['Камчатская область', 'Петропавловск-Камчатский', 'г'],
        ['Кемеровская область', 'Кемерово', 'г'],
        ['Кировская область', 'Киров', 'г'],
        ['Костромская область', 'Кострома', 'г'],
        ['Курганская область', 'Курган', 'г'],
        ['Курская область', 'Курск', 'г'],
        ['Магаданская область', 'Магадан', 'г'],
        ['Мурманская область', 'Мурманск', 'г'],
        ['Нижегородская область', 'Нижний Новгород', 'г'],
        ['Новгородская область', 'Новгород', 'г'],
        ['Новосибирская область', 'Новосибирск', 'г'],
        ['Омская область', 'Омск', 'г'],
        ['Оренбургская область', 'Оренбург', 'г'],
        ['Пензенская область', 'Пенза', 'г'],
        ['Пермский край', 'Пермь', 'г'],
        ['Псковская область', 'Псков', 'г'],
        ['Ростовская область', 'Ростов-на-Дону', 'г'],
        ['Рязанская область', 'Рязань', 'г'],
        ['Саратовская область', 'Саратов', 'г'],
        ['Сахалинская область', 'Южно-Сахалинск', 'г'],
        ['Свердловская область', 'Екатеринбург', 'г'],
        ['Смоленская область', 'Смоленск', 'г'],
        ['Тамбовская область', 'Тамбов', 'г'],
        ['Тверская область', 'Тверь', 'г'],
        ['Томская область', 'Томск', 'г'],
        ['Тульская область', 'Тула', 'г'],
        ['Тюменская область', 'Тюмень', 'г'],
        ['Ульяновская область', 'Ульяновск', 'г'],
        ['Челябинская область', 'Челябинск', 'г'],
        ['Забайкальский край', 'Чита', 'г'],
        ['Ярославская область', 'Ярославль', 'г'],
        ['Еврейская автономная область', 'Биробиджан', 'г'],
        ['Агинский Бурятский автономный округ', 'Агинское', 'пгт'],
        ['Корякский автономный округ', 'Палана', 'пгт'],
        ['Ненецкий автономный округ', 'Нарьян-Мар', 'г'],
        ['Таймырский (Долгано-Ненецкий) автономный округ', 'Дудинка', 'г'],
        ['Усть-Ордынский Бурятский автономный округ', 'Усть-Ордынский', 'пгт'],
        ['Ханты-Мансийский автономный округ - Югра', 'Ханты-Мансийск', 'г'],
        ['Чукотский автономный округ', 'Анадырь', 'г'],
        ['Эвенкийский автономный округ', 'Тура', 'пгт'],
        ['Ямало-Ненецкий автономный округ', 'Салехард', 'г'],
        ['Чеченская Республика', 'Грозный', 'г'],
    ];

    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        foreach ($this->regions as $region) {
            $this->insert('{{%region}}', [
                'name' => $region[0]
            ]);

            $insertedRegion = Region::find()
                ->where(['name' => $region[0]])
                ->one();

            $this->insert('{{%city}}', [
                'name' => $region[1],
                'city_type_id' => $region[2] == 'пгт' ? 6 : 1,
                'region_id' => $insertedRegion->id,
                'is_region_center' => 1
            ]);
        }
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        foreach ($this->regions as $region) {
            $this->delete('{{%city}}', ['name' => $region[1]]);
            // the deletion of values from the region table is optional (reason: there can be tired values in othertables ('city'))
            // uncoment the line below to execute the deletion
            // $this->delete('{{%region}}', ['name' => $region[0]]);
        }
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m240329_082938_add_rf_regions_and_capitals cannot be reverted.\n";

        return false;
    }
    */
}
